In [67]:
import pandas as pd
from datetime import datetime, timedelta
from enum import Enum
from sklearn.preprocessing import MinMaxScaler

In [7]:
estudio1 = pd.read_csv('csv/initial_survey_estudio_1.csv')
estudio1 = estudio1[['participant', 'age', 'gender', 'income', 'postcode']]
estudio1.rename(columns={"participant": "id", "postcode": "zip_code"}, inplace=True)

# Calculate birth year based on age
estudio1['age'] = datetime.now().year - estudio1['age']

# Create birth_date column with January 1 as the birth date
estudio1['age'] = pd.to_datetime(estudio1['age'].astype(str) + '-01-01')

estudio1 = estudio1.rename(columns={'age': 'birth_date'})

estudio1.head()

      id birth_date  gender       income  zip_code
0  A3FNz 1992-01-01    male  12450-20200       NaN
1  A3XAe 1954-01-01  female  20200-35200       NaN
2  A3XNv 2003-01-01    male      0-12450   28891.0
3  Ac3N5 1995-01-01    male  20200-35200    8025.0
4  Ag5za 1957-01-01  female  12450-20200   28003.0

In [8]:
estudio2 = pd.read_csv('csv/initial_survey_estudio_2.csv')
estudio2 = estudio2[['participant', 'birth_year', 'gender', 'income', 'postcode']]
estudio2.rename(columns={"participant": "id", "postcode": "zip_code"}, inplace=True)
# Convert birth_year to birth_date with January 1 as the birth date
estudio2['birth_year'] = pd.to_datetime(estudio2['birth_year'].astype(str) + '-01-01')

# Drop the birth_year column as it's no longer needed
estudio2 = estudio2.rename(columns={'birth_year': 'birth_date'})

estudio2.head()

      id birth_date  gender       income  zip_code
0  AMdzA 1978-01-01  female  20200-35200    1002.0
1  ASTAT 1997-01-01    male  20200-35200    3015.0
2  AWtpE 1963-01-01  female  12450-20200    3001.0
3  AYTpR 1976-01-01  female      0-12450    3540.0
4  AZpyK 1969-01-01  female  20200-35200    3001.0

In [4]:
estudio1['studyId'] = 'aFeH8'
estudio2['studyId'] = 'H39eC'

In [5]:
estudio1.head()

      id  gender  zip_code       income birth_date studyId
0  A3FNz    male       NaN  12450-20200 1992-01-01   aFeH8
1  A3XAe  female       NaN  20200-35200 1954-01-01   aFeH8
2  A3XNv    male   28891.0      0-12450 2003-01-01   aFeH8
3  Ac3N5    male    8025.0  20200-35200 1995-01-01   aFeH8
4  Ag5za  female   28003.0  12450-20200 1957-01-01   aFeH8

In [74]:
indicadores = pd.read_csv('csv/indicators.csv')

In [36]:
indicadores.rename(columns={"study_id": "studyId", "participant": "participantId", "indicator_id": "indicatorNameId"}, inplace=True)

In [37]:
indicadores.head()

  studyId participantId        date  indicatorNameId    value  weighting
0   aFeH8         A3FNz  2021-11-16                1  1672.22   0.808028
1   aFeH8         A3FNz  2021-11-17                1  1896.95   0.943785
2   aFeH8         A3FNz  2021-11-18                1   672.58   0.356847
3   aFeH8         A3FNz  2021-11-19                1  1889.60   0.929597
4   aFeH8         A3FNz  2021-11-20                1  1937.26   0.942528

In [38]:
indicadores['indicatorNameId'] = indicadores['indicatorNameId'].replace(2, 6)

In [40]:
indicadores['indicatorNameId'] = indicadores['indicatorNameId'].replace(1, 2)
indicadores['indicatorNameId'] = indicadores['indicatorNameId'].replace(4, 2)

In [42]:
indicadores['indicatorNameId'] = indicadores['indicatorNameId'].replace(5, 1)

In [44]:
indicadores['indicatorNameId'] = indicadores['indicatorNameId'].replace(3, 4)
indicadores['indicatorNameId'] = indicadores['indicatorNameId'].replace(7, 4)

In [46]:
indicadores['indicatorNameId'] = indicadores['indicatorNameId'].replace(6, 3)

In [19]:
indicator_name = pd.DataFrame(columns=['name'])
indicator_name['name'] = ['social_interaction', 'physical_activity', 'emmotional_state', 'overall_wellbeing']

In [25]:
criterion = pd.DataFrame(columns=['name', 'nature'])
criterion['name'] = ['gender', 'income', 'zip_code', 'age']
criterion['nature'] = [1, 1, 1, 2]

In [27]:
studies = pd.DataFrame({
    'id': ['H39eC', 'aFeH8'],
    'name': ['Estudio 1', 'Estudio 2'],
    'description': ['Estudio 1', 'Estudio 2']
})

In [51]:
studies.head()

      id       name description
0  H39eC  Estudio 1   Estudio 1
1  aFeH8  Estudio 2   Estudio 2